/* This computer's Internet connection appears to be offline. */
"CONNECTION_DOWN" = "การเชื่อมต่ออินเทอร์เน็ตของคอมพิวเตอร์นี้ดูเหมือนว่าไม่ได้ออนไลน์";

/* This computer's Internet connection may be offline. */
"CONNECTION_INDETERMINATE" = "การเชื่อมต่ออินเทอร์เน็ตของคอมพิวเตอร์นี้อาจจะไม่ได้ออนไลน์";

/* This computer's Internet connection appears to be online. */
"CONNECTION_UP" = "การเชื่อมต่ออินเทอร์เน็ตของคอมพิวเตอร์นี้ดูเหมือนว่าออนไลน์";

/* This computer's DNS server is not responding. */
"NAMESERVER_DOWN" = "เซิร์ฟเวอร์ DNS ของคอมพิวเตอร์เครื่องนี้ไม่ตอบสนอง";

/* The DNS server could not find the server name. */
"NAMELOOKUP_FAILED" = "เซิร์ฟเวอร์ DNS ไม่สามารถหาชื่อเซิร์ฟเวอร์";

/* This computer's router is not responding. */
"ROUTER_DOWN" = "เราเตอร์ของคอมพิวเตอร์เครื่องนี้ไม่ตอบสนอง";

/* The server this computer is attempting to connect to is not responding. */
"SERVER_DOWN" = "เซิร์ฟเวอร์ที่คอมพิวเตอร์เครื่องนี้พยายามเชื่อมต่อไม่ตอบสนอง";

/* This computer's Internet connection appears to be online. */
"SERVER_UP" = "การเชื่อมต่ออินเทอร์เน็ตของคอมพิวเตอร์นี้ดูเหมือนว่าออนไลน์";

/* Format string for label of a saved password in Keychain: URL (USERNAME) */
"KEYCHAIN_LABEL_FORMAT" = "%@ (%@)";

/* Kind string used for keychain items from forms-based logins */
"KEYCHAIN_WEB_FORM_PASSWORD" = "รหัสผ่านของแบบฟอร์มบนเว็บ";

/* HTTP result code string */
"accepted" = "ได้ตอบรับ";

/* HTTP result code string */
"bad gateway" = "เกตเวย์ไม่สมบูรณ์";

/* HTTP result code string */
"bad request" = "คำขอไม่สมบูรณ์";

/* HTTP result code string */
"client error" = "ข้อผิดพลาดไคลเอนด์";

/* HTTP result code string */
"conflict" = "ขัดแย้ง";

/* HTTP result code string */
"continue" = "ต่อไป";

/* HTTP result code string */
"created" = "ได้สร้าง";

/* HTTP result code string */
"expectation failed" = "ไม่เป็นไปตามความคาดหวัง";

/* HTTP result code string */
"forbidden" = "ต้องห้าม";

/* HTTP result code string */
"found" = "หาพบ";

/* HTTP result code string */
"gateway timed out" = "เกตเวย์หมดเวลา";

/* HTTP result code string */
"informational" = "ให้ข้อมูล";

/* HTTP result code string */
"internal server error" = "ข้อผิดพลาดเซิร์ฟเวอร์ภายใน";

/* HTTP result code string */
"length required" = "ต้องกำหนดความยาว";

/* HTTP result code string */
"method not allowed" = "วิธีการไม่ได้รับอนุญาต";

/* HTTP result code string */
"moved permanently" = "ย้ายถาวร";

/* HTTP result code string */
"multiple choices" = "ข้อเลือกหลายข้อ";

/* HTTP result code string */
"needs proxy" = "ต้องใช้พร็อกซี่";

/* HTTP result code string */
"no content" = "ไม่มีเนื้อหา";

/* HTTP result code string */
"no error" = "ไม่มีข้อผิดพลาด";

/* HTTP result code string */
"non-authoritative information" = "ข้อมูลที่ไม่ต้องขออนุญาต";

/* HTTP result code string */
"not found" = "ไม่พบ";

/* HTTP result code string */
"not modified" = "ไม่ได้เปลี่ยน";

/* HTTP result code string */
"partial content" = "เนื้อหาบางส่วน";

/* HTTP result code string */
"payment required" = "ต้องเสียค่าใช้จ่าย";

/* HTTP result code string */
"precondition failed" = "เงื่อนไขเบื้องต้นไม่ผ่าน";

/* HTTP result code string */
"proxy authentication required" = "ต้องการรับรองความถูกต้องของพร็อกซี่";

/* HTTP result code string */
"redirected" = "ได้เปลี่ยนเส้นทาง";

/* HTTP result code string */
"no longer exists" = "ไม่มีอีกต่อไป";

/* HTTP result code string */
"request timed out" = "การขอหมดเวลา";

/* HTTP result code string */
"request too large" = "การขอใหญ่เกินไป";

/* HTTP result code string */
"requested URL too long" = "URL ที่ขอยาวไป";

/* HTTP result code string */
"requested range not satisfiable" = "ช่วงร้องขอไม่เป็นไปตามต้องการ";

/* HTTP result code string */
"reset content" = "รีเซ็ตเนื้อหา";

/* HTTP result code string */
"see other" = "ดูอื่นๆ";

/* HTTP result code string */
"server error" = "ข้อผิดพลาดเซิร์ฟเวอร์";

/* HTTP result code string */
"service unavailable" = "บริการยังไม่พร้อม";

/* HTTP result code string */
"success" = "สำเร็จ";

/* HTTP result code string */
"switching protocols" = "สลับเปลี่ยนโปรโตคอล";

/* HTTP result code string */
"temporarily redirected" = "ได้เปลี่ยนเส้นทางชั่วคราว";

/* HTTP result code string */
"unacceptable" = "ยอมรับไม่ได้";

/* HTTP result code string */
"unauthorized" = "ไม่ได้อนุมัติ";

/* HTTP result code string */
"unimplemented" = "ยังไม่ได้ทำขึ้น";

/* HTTP result code string */
"unsupported media type" = "ประเภทสื่อไม่รองรับ";

/* HTTP result code string */
"unsupported version" = "เวอร์ชั่นไม่รองรับ";

/* kCFErrorHTTPProxyConnectionFailure description */
"Err306" = "เกิดปัญหาสื่อสารกับเซิร์ฟเวอร์เว็บพร็อกซี่ (HTTP)";

/* kCFErrorHTTPSProxyConnectionFailure description */
"Err310" = "เกิดปัญหาสื่อสารกับเซิร์ฟเวอร์ของเว็บพร็อกซี่ (HTTP) แบบปลอดภัย";

/* WebFoundationErrorUnknown description */
"Err-998" = "ข้อผิดพลาดไม่มีชื่อ";

/* WebFoundationErrorCancelled description */
"Err-999" = "ถูกยกเลิก";

/* WebFoundationErrorBadURLError description */
"Err-1000" = "URL ไม่สมบูรณ์";

/* WebFoundationErrorTimedOut description */
"Err-1001" = "การขอหมดเวลา";

/* WebFoundationErrorUnsupportedURL description */
"Err-1002" = "URL ไม่รองรับ";

/* WebFoundationErrorCannotFindHostError description */
"Err-1003" = "ไม่พบเซิร์ฟเวอร์ตามชื่อที่ระบุ";

/* WebFoundationErrorCannotConnectToHostError description */
"Err-1004" = "ไม่สามารถติดต่อกับเซิร์ฟเวอร์";

/* WebFoundationErrorNetworkConnectionLostError description */
"Err-1005" = "การเชื่อมต่อกับเครือข่ายหายไป";

/* WebFoundationErrorDNSLookupError description */
"Err-1006" = "ข้อผิดพลาดค้นหา DNS";

/* WebFoundationErrorHTTPTooManyRedirectsError description */
"Err-1007" = "เกิดการเปลี่ยนทาง HTTP มากเกินไป";

/* WebFoundationErrorResourceUnavailableError description */
"Err-1008" = "ทรัพยากรไม่พร้อมใช้งาน";

/* WebFoundationErrorNotConnectedToInternetError description */
"Err-1009" = "การเชื่อมต่ออินเทอร์เน็ตดูเหมือนว่าไม่ได้ออนไลน์";

/* WebFoundationErrorRedirectToNonExistentLocation description */
"Err-1010" = "ไม่ทราบเส้นทางเปลี่ยนที่อยู่หน้าเว็บ";

/* WebFoundationErrorBadServerResponseError description */
"Err-1011" = "เกิดการตอบสนองที่ไม่สมบูรณ์จากเซิร์ฟเวอร์";

/* WebFoundationErrorZeroByteResourceError description */
"Err-1014" = "ทรัพยากรศูนย์ไบต์";

/* WebFoundationErrorCannotDecodeRawData description */
"Err-1015" = "ไม่สามารถถอดรหัสข้อมูล RAW";

/* WebFoundationErrorCannotDecodeContentData description */
"Err-1016" = "ไม่สามารถถอดรหัสข้อมูลเนื้อหา";

/* WebFoundationErrorCannotParseResponse description */
"Err-1017" = "ไม่สามารถตีความการสนอง";

/* kCFURLErrorInternationalRoamingOff description */
"Err-1018" = "การใช้เครือข่ายร่วมระหว่างประเทศปิดใช้อยู่ขณะนี้";

/* kCFURLErrorCallIsActive description */
"Err-1019" = "ไม่สามารถเริ่มการเชื่อมต่อข้อมูลเนื่องจากใช้สายอยู่ขณะนี้";

/* kCFURLErrorDataNotAllowed description */
"Err-1020" = "ไม่อนุญาตให้เชื่อมต่อข้อมูลขณะนี้";

/* kCFURLErrorRequestBodyStreamExhausted description.  Should never be seen by an end user. */
"Err-1021" = "การถ่ายทอดส่วนของเนื้อหาที่ขอได้หยุด";
	
/* WebFoundationErrorFileDoesNotExist description */
"Err-1100" = "ไม่พบ URL ที่ขอบนเซิร์ฟเวอร์นี้";

/* WebFoundationErrorFileIsDirectory description */
"Err-1101" = "ไฟล์นี้คือไดเร็กทอรี";

/* WebFoundationErrorNoPermissionsToReadFile description */
"Err-1102" = "คุณไม่ได้รับสิทธิ์ให้เข้าถึงทรัพยากรที่ขอ";

/* WebFoundationErrorDataLengthExceedsMaximum description */
"Err-1103" = "ทรัพยากรเกินขนาดสูงสุด";

/* WebFoundationErrorSecureConnectionFailed description */
"Err-1200" = "ได้เกิดข้อผิดพลาด SSL และไม่สามารถสร้างการเชื่อมต่อแบบปลอดภัยกับเซิร์ฟเวอร์";

/* WebFoundationErrorServerCertificateHasBadDate description */
"Err-1201" = "ใบรับรองสำหรับเซิร์ฟเวอร์ได้หมดเวลาแล้ว";

/* WebFoundationErrorServerCertificateHasBadDate description */
"Err-1201.w" = "ใบรับรองสำหรับเซิร์ฟเวอร์นี้ได้หมดเวลาแล้ว คุณอาจจะเชื่อมต่อกับเซิร์ฟเวอร์ที่แกล้งเป็น “%@” ซึ่งจะเป็นอันตรายกับข้อมูลส่วนตัวของคุณ";

/* WebFoundationErrorServerCertificateUntrusted description */
"Err-1202" = "ใบรับรองสำหรับเซิร์ฟเวอร์นี้ไม่ถูกต้อง";

/* WebFoundationErrorServerCertificateUntrusted description */
"Err-1202.w" = "ใบรับรองสำหรับเซิร์ฟเวอร์นี้ไม่ถูกต้อง คุณอาจจะเชื่อมต่อกับเซิร์ฟเวอร์ที่แกล้งเป็น “%@” ซึ่งจะเป็นอันตรายกับข้อมูลส่วนตัวของคุณ";

/* WebFoundationErrorServerCertificateHasUnknownRoot description */
"Err-1203" = "ใบรับรองสำหรับเซิร์ฟเวอร์นี้ลงชื่อโดยผู้อนุมัติใบรับรองจากผู้ที่ไม่รู้จัก";

/* WebFoundationErrorServerCertificateHasUnknownRoot description */
"Err-1203.w" = "ใบรับรองสำหรับเซิร์ฟเวอร์ลงชื่อโดยผู้อนุมัติใบรับรองจากผู้ที่ไม่รู้จัก คุณอาจจะเชื่อมต่อกับเซิร์ฟเวอร์ที่แกล้งเป็น “%@” ซึ่งจะเป็นอันตรายกับข้อมูลส่วนตัวของคุณ";

/* WebFoundationErrorServerCertificateNotYetValid description */
"Err-1204" = "ใบรับรองสำหรับเซิร์ฟเวอร์นี้ยังใช้ไม่ได้";

/* WebFoundationErrorServerCertificateNotYetValid description */
"Err-1204.w" = "ใบรับรองสำหรับเซิร์ฟเวอร์นี้ยังใช้ไม่ได้ คุณอาจจะเชื่อมต่อกับเซิร์ฟเวอร์ที่แกล้งเป็น “%@” ซึ่งจะเป็นอันตรายกับข้อมูลส่วนตัวของคุณ";

/* WebFoundationErrorClientCertificateRejected description */
"Err-1205" = "เซิร์ฟเวอร์ไม่ได้ตอบรับใบรับรอง";

/* WebFoundationErrorClientCertificateRejected description */
"Err-1205.w" = "เซิร์ฟเวอร์ “%@” ไม่ได้ตอบรับใบรับรอง";

/* WebFoundationErrorClientCertificateRequired description */
"Err-1206" = "เซิร์ฟเวอร์ต้องการใบรับรองของไคลเอนท์";

/* WebFoundationErrorClientCertificateRequired description */
"Err-1206.w" = "เซิร์ฟเวอร์ “%@” ต้องการใบรับรองของไคลเอนท์";

/* WebFoundationErrorCannotLoadFromNetworkError description */
"Err-2000" = "ไม่สามารถโหลดจากเครือข่าย";

/* WebFoundationErrorCannotCreateFile description */
"Err-3000" = "ไม่สามารถสร้างไฟล์";

/* WebFoundationErrorCannotOpenFile description */
"Err-3001" = "ไม่สามารถเปิดไฟล์";

/* WebFoundationErrorCannotCloseFile description */
"Err-3002" = "เกิดความไม่สำเร็จขณะปิดไฟล์";

/* WebFoundationErrorCannotWriteToFile description */
"Err-3003" = "ไม่สามารถเขียนไฟล์";

/* WebFoundationErrorCannotRemoveFile description */
"Err-3004" = "ไม่สามารถลบไฟล์";

/* WebFoundationErrorCannotMoveFile description */
"Err-3005" = "ไม่สามารถย้ายไฟล์";

/* WebFoundationErrorDownloadDecodingFailedMidStream description */
"Err-3006" = "ดาวน์โหลดการถอดรหัสไม่สำเร็จ";

/* WebFoundationErrorDownloadDecodingFailedToComplete description */
"Err-3007" = "ดาวน์โหลดการถอดรหัสไม่สำเร็จ";

/* Recovery suggestion */
"Would you like to connect to the server anyway?" = "ยังคงต้องการเชื่อมต่อกับเซิร์ฟเวอร์หรือไม่";

/* Recovery suggestion */
"Please check your proxy settings. For help with this problem, contact your system administrator." = "กรุณาตรวจสอบค่าติดตั้งพร็อกซี่ของคุณ ติดต่อผู้ดูแลระบบของคุณสำหรับความช่วยเหลือกับปัญหานี้";

/* AuthBrokerAgent proxy credential user notification - alert header */
"Proxy Authentication Required" = "ต้องการรับรองความถูกต้องของพร็อกซี่";

/* AuthBrokerAgent proxy credential user notification - alert message, args are 1) proxy type, 2) host name, 3) port number, e.g.:  Authentication for HTTP proxy csd3.apple.com:8080 */
"Authentication for %@ proxy\n%@:%d" = "การรับรองความถูกต้องสำหรับพร็อกซี่ของ %@\n%@:%d";

/* AuthBrokerAgent proxy credential user notification - Cancel button title */
"Cancel" = "ยกเลิก";

/* AuthBrokerAgent proxy credential user notification - Username title */
"Username" = "ชื่อผู้ใช้";

/* AuthBrokerAgent proxy credential user notification - Password title */
"Password" = "รหัสผ่าน";
